tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap 'homebrew/cask-drivers'
tap "homebrew/cask-versions"


brew 'mas' # Mac App Store manager
brew "coreutils"

brew 'pkg-config', link: true
brew 'tmux'

brew 'bash'
brew 'bash-completion'
brew 'zsh'

brew 'vim'
brew 'nvim'

brew 'git'
brew 'git-lfs'

# Install GnuPG to enable PGP-signing commits.
brew  'gnupg'

brew  'grep'
brew  'openssh'


# 磁盘空间查看工具
brew 'ncdu'

brew 'ruby'
brew 'python3'

brew 'the_silver_searcher'




cask 'wechat' # 聊天软件，微信
cask 'wechatwork' # 聊天软件，企业微信
cask 'visual-studio-code' #  开发 ide，vscode
cask 'google-chrome' 
cask 'iterm2'
cask 'notion'
cask 'docker'
cask 'charles'
cask 'postman'
cask 'sublime-text'
cask 'slack'
cask 'dropbox'
cask 'youdaodict'
cask 'karabiner-elements'
cask 'tencent-lemon'
cask 'zoom'
cask 'vnc-viewer'
cask 'neteasemusic'
cask 'shadowsocksx-ng'
cask 'openvpn-connect'
cask 'vlc'
cask 'calibre'
cask 'virtualbox'
cask 'transmission'
cask 'telegram-desktop'
cask 'imageoptim'
cask 'dbngin'
cask 'omnifocus'
cask 'tableplus'
cask 'hiddenbar'
cask 'anki'
cask 'onedrive'
cask 'synergy'
cask 'ngrok'
cask 'rectangle'
cask 'emacs'
cask 'font-hack-nerd-font'
cask 'keepassxc'
cask 'anaconda'
cask 'dbeaver-community'
cask 'alacritty'
cask 'keka'
cask 'cyberduck'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825


cask 'font-fira-code'
