tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap 'homebrew/cask-drivers'
tap "homebrew/cask-versions"


brew 'mas' # Mac App Store manager
brew "coreutils"

brew 'pkg-config', link: true
brew 'tmux'

# search tools
brew 'fd'
brew 'fzf'
brew  'grep'
brew 'the_silver_searcher'
brew 'ripgrep'

brew 'bash'
brew 'bash-completion'
brew 'zsh'

brew 'vim'
brew 'nvim'

brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'lazygit'

# Install GnuPG to enable PGP-signing commits.
brew  'gnupg'

brew  'openssh'
brew 'wget'

brew 'asdf'

# 磁盘空间查看工具
# brew 'ncdu'

brew 'ruby'
brew 'pyenv'


cask 'iterm2'
cask 'wechat' # 聊天软件，微信
# cask 'wechatwork' # 聊天软件，企业微信
cask 'visual-studio-code' #  开发 ide，vscode
cask 'notion'
# cask 'docker'
# cask 'charles'
# cask 'postman'
cask 'youdaodict'
cask 'karabiner-elements'
# cask 'tencent-lemon'
# cask 'vnc-viewer'
# cask 'neteasemusic'
cask 'openvpn-connect'
cask 'vlc'
cask 'calibre'
# cask 'virtualbox'
# cask 'transmission'
# cask 'telegram-desktop'
cask 'imageoptim'
# cask 'dbngin'
# cask 'omnifocus'
# cask 'tableplus'
cask 'hiddenbar'
# cask 'anki'
# cask 'onedrive'
# cask 'ngrok'
cask 'rectangle'
# cask 'dbeaver-community'
# cask 'alacritty'
cask 'keka'
# cask 'cyberduck'
cask 'clashx'
# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

cask 'font-fira-code'
cask 'font-ibm-plex'

mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825


