{{- if eq .chezmoi.os "darwin" -}}

# Taps
tap "koekeishiya/formulae"     # 窗口管理工具源
tap "laishulu/homebrew"        # 中文相关工具源
tap "daipeihust/tap" # im-select

# CLI Tools (brew)
brew "atuin"                   # Shell 历史记录管理工具
brew "bash"                    # Bash Shell
brew "bat"                     # 增强版 cat 命令
brew "bitwarden-cli"          # Bitwarden 密码管理器命令行工具
brew "direnv"                 # 目录环境变量管理工具
brew "eza"                    # 现代化的 ls 替代品
brew "fd"                     # 更友好的文件查找工具
brew "fzf"                    # 模糊查找工具
brew "git"                    # 版本控制系统
brew "git-extras"             # Git 扩展命令
brew "git-lfs"                # Git 大文件存储
brew "htop"                   # 交互式进程查看器
brew "kubernetes-cli"         # Kubernetes 命令行工具
brew "lazygit"                # Git 终端界面
brew "neovim"                 # 现代化的 Vim 编辑器
brew "powerlevel10k"          # Zsh 主题
brew "reattach-to-user-namespace" # tmux macOS 集成
brew "ripgrep"                # 快速搜索工具
brew "tmux"                   # 终端复用器
brew "zoxide"                 # 智能目录跳转工具
brew "zsh"                    # Zsh Shell
brew "ollama", restart_service: true  # 本地 LLM 运行工具
brew "im-select"

# Applications (cask)
cask "kitty"                  # 现代化终端模拟器
cask "alfred"                 # 效率启动器
cask "font-blex-mono-nerd-font" # IBM Plex Mono Nerd 字体
cask "git-credential-manager" # Git 凭证管理器
cask "hiddenbar"             # 菜单栏图标管理工具
cask "orbstack"              # 容器和虚拟机管理工具
cask "cursor"                # AI 辅助编程 IDE
cask "postgres-unofficial"    # PostgreSQL 数据库
cask "postico"               # PostgreSQL 客户端
cask "wezterm"               # GPU 加速终端模拟器
cask "visual-studio-code"    # VS Code 编辑器
cask "nextcloud"             # 云存储客户端
cask "omnifocus"             # 任务管理工具
cask "telegram"              # 即时通讯工具
cask "obsidian"              # 笔记

# VS Code Extensions
vscode "github.copilot"       # GitHub Copilot AI 代码助手
vscode "github.copilot-chat"  # GitHub Copilot 聊天功能

{{ if eq .chezmoi.hostname "MBP-LY46J97761-0114.local" }}
# office mac

{{ else if eq .chezmoi.hostname "MacBook-Pro-Home" }}

{{- end -}}

{{- end -}}
