# common tools
tap "homebrew/bundle"
tap "homebrew/services"
brew 'tmux'
brew 'bash'
brew 'zsh'
brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'nvim'
brew 'lazygit'
brew 'ripgrep'
brew 'fzf'
brew 'bat'
brew 'fd'
brew 'eza'
brew 'powerlevel10k'
brew 'reattach-to-user-namespace'
brew 'kubectl'
brew 'ansible'
# install font
tap "homebrew/cask-fonts"
cask 'font-blex-mono-nerd-font'
# install yabai and skhd
tap "koekeishiya/formulae"
brew 'skhd'
brew 'yabai'
brew 'zoxide'

# install cask
cask 'squirrel'
cask 'alacritty'
cask 'git-credential-manager'
cask 'postico'
cask 'postgres-unofficial'
cask 'lens'
cask 'wechat'
cask 'visual-studio-code'

tap 'daipeihust/tap'
brew 'im-select'


# scene special 
brew "unison"
