tap "homebrew/bundle"
tap "homebrew/services"
brew 'tmux'
brew 'bash'
brew 'zsh'
brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'nvim'
brew 'lazygit'
brew 'ripgrep'
brew 'fzf'
brew 'bat'
brew 'fd'
brew 'exa'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'xclip'
brew 'gitui'

