tap "homebrew/bundle"
tap "homebrew/services"
brew 'tmux'
brew 'bash'
brew 'zsh'
brew 'git'
brew 'git-lfs'
brew 'git-extras'
brew 'nvim'
brew 'lazygit'
brew 'ripgrep'
brew 'fzf'
brew 'bat'
brew 'fd'
brew 'exa'
#brew 'ranger'
#brew 'navi'
#brew 'thefuck'
brew 'romkatv/powerlevel10k/powerlevel10k'


## tap "homebrew/cask-drivers"
## tap "homebrew/cask-versions"
## tap "homebrew/cask"
# https://github.com/Homebrew/homebrew-cask-fonts/tree/master/Casks
# it seems the font can only install for darwin, linux will skiped
tap "homebrew/cask-fonts"
cask 'font-blex-mono-nerd-font'
tap "koekeishiya/formulae"
#  skhd yabai and p10k need run `xcode-select --install` first if install failed
brew 'skhd'
brew 'yabai'
brew 'reattach-to-user-namespace'
brew 'gitui'
cask 'squirrel'
cask 'alacritty'
cask 'git-credential-manager'

