tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "laishulu/homebrew"
brew "ansible"
brew "atuin"
brew "autoconf"
brew "bash"
brew "bat"
brew "bitwarden-cli"
brew "eza"
brew "fd"
brew "fop"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "htop"
brew "kubernetes-cli"
brew "lazygit"
brew "libxslt"
brew "neofetch"
brew "neovim"
brew "ollama", restart_service: true
brew "powerlevel10k"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "tmux"
brew "wxwidgets"
brew "zoxide"
brew "zsh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "alfred"
cask "font-blex-mono-nerd-font"
cask "font-sarasa-nerd"
cask "git-credential-manager"
cask "google-chrome"
cask "hiddenbar"
cask "lens"
cask "orbstack"
cask "postgres-unofficial"
cask "postico"
cask "squirrel"
cask "tencent-lemon"
cask "visual-studio-code"
cask "wezterm"
vscode "github.copilot"
vscode "github.copilot-chat"
